# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества.
# m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

from random import randint
n = int(input('Введите количество элементов первого множества: '))
m = int(input('Введите количество элементов второго множества: '))

list_1 = [randint(0, 100) for i in range(n)]
list_2 = [randint(0, 100) for i in range(m)]
#list_1 = [18, 91, 29, 79, 71, 10, 65, 78, 86, 67, 48, 64, 40, 11, 61, 30, 49, 84, 23, 50, 55, 12, 2, 1, 81, 99, 58, 34, 97, 17, 35, 33, 91, 0, 63, 81, 81, 86, 94, 37]
#list_2 = [13, 32, 84, 71, 93, 77, 62, 16, 20, 82, 54, 77, 14, 60, 53, 80, 95, 76, 24, 22, 43, 13, 0, 65, 93, 92, 99, 21, 15, 1, 27, 87, 97, 94, 2, 22, 25, 21, 94, 1]
print(list_1)
print(list_2)
list_1 = set(list_1)
list_2 = set(list_2)
list_3 = list_1.intersection(list_2)
list_3 = list(list_3)
print(list_3)
for i in range(len(list_3) - 1):
    for j in range(len(list_3)-1):
        if list_3[j+1] < list_3[j]:
            list_3[j+1], list_3[j] = list_3[j], list_3[j+1]

print(list_3)





